/////////////////////////////////////////////////////////////
//
// Author: попълнете името си тук
// FN: попълнете факултетния си номер тук
// Program: изберете коректното: Информатика, Информационни системи, Компютърни науки, Софтуерно инженерство
// Date: 25.08.2017
//

///
/// Клас, представящ интервал
///
class Interval
{
  // моля, попълнете реализацията на клас тук
};

///
/// Клас представящ множество от интервали
///
class IntervalSet
{
  // моля, попълнете реализацията на клас тук
};


// Този ред включва тестовете за задачата
#include "prob2-tests.h"

int main() {

//-------------------------------------------------------------------------
//
// ВАЖНО: Преди предаване на решението, моля премахнете коментара от дадения по-долу ред,
//        за да активирате автоматичните тестове за решението си.
//
//-------------------------------------------------------------------------

//  RunTests();
  
  return 0;
}
