/////////////////////////////////////////////////////////////
//
// Author: попълнете името си тук
// FN: попълнете факултетния си номер тук
// Program: изберете коректното: Информатика, Информационни системи, Компютърни науки, Софтуерно инженерство
// Date: 25.08.2017
//

///
/// Клас, представящ статистика за температура
///
class Temperature
{
  // моля, попълнете реализацията на клас тук
};

///
/// Клас, представящ прогноза
///
class Forecast
{
  // моля, попълнете реализацията на клас тук
};


// Този ред включва тестовете за задачата
#include "prob3-tests.h"

int main() {

//-------------------------------------------------------------------------
//
// ВАЖНО: Преди предаване на решението, моля премахнете коментара от дадения по-долу ред,
//        за да активирате автоматичните тестове за решението си.
//
//-------------------------------------------------------------------------

//  RunTests();
  
  return 0;
}
